test/multiphaseEuler/populationBalance/negativeDrift/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type populationBalanceMultiphaseSystem;

phases (air water);

referencePhase water;

populationBalances (bubbles);

air
{
    type            pureIsothermalPhaseModel;
    diameterModel   velocityGroup;
    velocityGroupCoeffs
    {
        populationBalance   bubbles;

        shapeModel          spherical;

        sizeGroups
        (
            { dSph 1.000; }
            { dSph 1.074; }
            { dSph 1.147; }
            { dSph 1.221; }
            { dSph 1.294; }
            { dSph 1.368; }
            { dSph 1.441; }
            { dSph 1.515; }
            { dSph 1.588; }
            { dSph 1.662; }
            { dSph 1.735; }
            { dSph 1.809; }
            { dSph 1.882; }
            { dSph 1.956; }
            { dSph 2.029; }
            { dSph 2.103; }
            { dSph 2.176; }
            { dSph 2.250; }
            { dSph 2.323; }
            { dSph 2.397; }
            { dSph 2.470; }
            { dSph 2.544; }
            { dSph 2.617; }
            { dSph 2.691; }
            { dSph 2.764; }
            { dSph 2.838; }
            { dSph 2.911; }
            { dSph 2.985; }
            { dSph 3.058; }
        );
    }

    residualAlpha   1e-6;
}

water
{
    type            pureIsothermalPhaseModel;
    diameterModel   none;

    residualAlpha   1e-6;
}

populationBalanceCoeffs
{
    bubbles
    {
        continuousPhase water;

        coalescenceModels
        ();

        binaryBreakupModels
        ();

        breakupModels
        ();

        driftModels
        (
            constant
            {
                rate    -1;
            }
        );

        nucleationModels
        ();
    }
}

blending
{
    default
    {
        type            continuous;
        phase           water;
    }
}

surfaceTension
{}

interfaceCompression
{}

drag
{}

virtualMass
{}

heatTransfer
{}

phaseTransfer
{}

lift
{}

wallLubrication
{}

turbulentDispersion
{}

// ************************************************************************* //
