test/multiphaseEuler/populationBalance/negativeDrift/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeFunc populationBalanceSizeDistribution
(
    name=numberDensity,
    populationBalance=bubbles,
    functionType=numberDensity,
    coordinateType=volume
)

#includeFunc populationBalanceMoments
(
    populationBalance=bubbles,
    momentType=integerMoment,
    coordinateType=volume,
    order=1
)

#includeFunc populationBalanceMoments
(
    populationBalance=bubbles,
    momentType=integerMoment,
    coordinateType=volume,
    order=0
)

#includeFunc probes
(
    name=probes,
    points=((0.5 0.5 0.5)),
    integerMoment0(N,v).bubbles,
    integerMoment1(N,v).bubbles,
    writeControl=writeTime
)

// ************************************************************************* //
